perseverance51/MCS8051/STC_SDCC_INC/STC12C54.h
#define PCA1_ECOM   0x40        //使能比较器1
#define PCA1_CAPP   0x20        //使能PCA模块1的上升沿捕获
#define PCA1_CAPN   0x10        //使能PCA模块1的下降沿捕获
#define PCA1_MAT    0x08        //匹配使能,当PCA的计数值与模块1设定的值相匹配时,置CCON.CCF1
#define PCA1_TOG    0x04        //翻转控制位,当PCA的计数值与模块1设定的值相匹配时,翻转CEX1的电平
#define PCA1_PWM    0x02        //脉宽调制模式,使能CEX1为脉宽调制输出口
#define PCA1_ECCF   0x01        //使能CCF1中断

/////////////////////////////////

sfr  CCAPM2     =   0xdc;       //PCA模块2模式寄存器    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       ECOM2   CAPP2   CAPN2   MAT2    TOG2    PWM2    ECCF2
                                //初始值=x000,0000      x       0       0       0       0       0       0       0

#define PCA2_ECOM   0x40        //使能比较器2
#define PCA2_CAPP   0x20        //使能PCA模块2的上升沿捕获
#define PCA2_CAPN   0x10        //使能PCA模块2的下降沿捕获
#define PCA2_MAT    0x08        //匹配使能,当PCA的计数值与模块2设定的值相匹配时,置CCON.CCF2
#define PCA2_TOG    0x04        //翻转控制位,当PCA的计数值与模块2设定的值相匹配时,翻转CEX2的电平
#define PCA2_PWM    0x02        //脉宽调制模式,使能CEX2为脉宽调制输出口
#define PCA2_ECCF   0x01        //使能CCF2中断

/////////////////////////////////

sfr  CCAPM3     =   0xdd;       //PCA模块3模式寄存器    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       ECOM3   CAPP3   CAPN3   MAT3    TOG3    PWM3    ECCF3
                                //初始值=x000,0000      x       0       0       0       0       0       0       0

#define PCA3_ECOM   0x40        //使能比较器3
#define PCA3_CAPP   0x20        //使能PCA模块3的上升沿捕获
#define PCA3_CAPN   0x10        //使能PCA模块3的下降沿捕获
#define PCA3_MAT    0x08        //匹配使能,当PCA的计数值与模块3设定的值相匹配时,置CCON.CCF3
#define PCA3_TOG    0x04        //翻转控制位,当PCA的计数值与模块3设定的值相匹配时,翻转CEX3的电平
#define PCA3_PWM    0x02        //脉宽调制模式,使能CEX3为脉宽调制输出口
#define PCA3_ECCF   0x01        //使能CCF3中断

/////////////////////////////////

//CCAPM0   -   ECOM CAPP CAPN MAT  TOG  PWM  CCF
// 00H     0    0    0    0    0    0    0    0     无操作,待机状态
// 42H     0    1    0    0    0    0    1    0     8位PWM输出,无中断
// 63H     0    1    1    0    0    0    1    1     8位PWM输出,产生CEX0上升沿中断
// 53H     0    1    0    1    0    0    1    1     8位PWM输出,产生CEX0下降沿中断
// 73H     0    1    1    1    0    0    1    1     8位PWM输出,产生CEX0跳变中断
// 20H     0    x    1    0    0    0    0    0     16位捕获模式,CEX0上升沿触发捕获
// 10H     0    x    0    1    0    0    0    0     16位捕获模式,CEX0下降沿触发捕获
// 30H     0    x    1    1    0    0    0    0     16位捕获模式,CEX0跳变触发捕获
// 48H     0    1    0    0    1    0    0    0     16位软件定时器
// 4CH     0    1    0    0    1    1    0    0     16位高速脉冲输出

/////////////////////////////////

sfr  CL         =   0xe9;       //PCA计数器低8位        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CH         =   0xf9;       //PCA计数器高8位        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP0L     =   0xea;       //PCA模块0寄存器低8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP1L     =   0xeb;       //PCA模块1寄存器低8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP2L     =   0xec;       //PCA模块2寄存器低8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP3L     =   0xed;       //PCA模块3寄存器低8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP0H     =   0xfa;       //PCA模块0寄存器高8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP1H     =   0xfb;       //PCA模块1寄存器高8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP2H     =   0xfc;       //PCA模块2寄存器高8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP3H     =   0xfd;       //PCA模块3寄存器高8位   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  PCA_PWM0   =   0xf2;       //PCA0模式PWM辅助寄存器 Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       -       -       -       -       -       EPC0H   EPC0L
                                //初始值=xxxx,xx00      x       x       x       x       x       x       0       0

/////////////////////////////////

sfr  PCA_PWM1   =   0xf3;       //PCA1模式PWM辅助寄存器 Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       -       -       -       -       -       EPC1H   EPC1L
                                //初始值=xxxx,xx00      x       x       x       x       x       x       0       0

/////////////////////////////////

sfr  PCA_PWM2   =   0xf4;       //PCA2模式PWM辅助寄存器 Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       -       -       -       -       -       EPC2H   EPC2L
                                //初始值=xxxx,xx00      x       x       x       x       x       x       0       0

/////////////////////////////////

sfr  PCA_PWM3   =   0xf5;       //PCA3模式PWM辅助寄存器 Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       -       -       -       -       -       EPC3H   EPC3L
                                //初始值=xxxx,xx00      x       x       x       x       x       x       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#endif
